#include <stdio.h>

#define ROWS 3 // кількість рядків масиву
#define COLS 4 // кількість стовпців масиву

int main() {
    int arr[ROWS][COLS] = {
        {3, 2, 5, 1},
        {9, 7, 8, 6},
        {12, 11, 10, 13}
    };
    int max = arr[0][0]; // початкове значення максимального елементу
    int min = arr[0][0]; // початкове значення мінімального елементу
    int max_i = 0, max_j = 0; // індекси максимального елементу
    int min_i = 0, min_j = 0; // індекси мінімального елементу

    // Пошук максимального та мінімального елементів та їх індексів
    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLS; j++) {
            if (arr[i][j] > max) {
                max = arr[i][j];
                max_i = i;
                max_j = j;
            }
            if (arr[i][j] < min) {
                min = arr[i][j];
                min_i = i;
                min_j = j;
            }
        }
    }

    // Вивід результатів
    printf("Максимальний елемент: %d\n", max);
    printf("Розташування максимального елементу: [%d][%d]\n", max_i, max_j);
    printf("Мінімальний елемент: %d\n", min);
    printf("Розташування мінімального елементу: [%d][%d]\n", min_i, min_j);

    return 0;
}
