#include <stdio.h> //

int main() {
    char surname[20]; // оголошення змінної для зберігання прізвища
    char name[20]; // оголошення змінної для зберігання імені
    char patronymic[20]; // оголошення змінної для зберігання по-батькові

    printf("Введіть прізвище: "); // 
    scanf("%s", surname); // зчитування  з консолі

    printf("Введіть ім'я: "); // 
    scanf("%s", name); // зчитування з консолі

    printf("Введіть по-батькові: "); //
    scanf("%s", patronymic); // зчитування з консолі

    printf("%c. %c. %c.\n", surname[0], name[0], patronymic[0]); // виведення ініціалів з крапками

    return 0;
}
